
1.CELCIUS AND FARENHEIT

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-CELCIUS PIC 9(4)V9(3).
  01 WS-FARENHEIT PIC 9(4)V9(3).
  
PROCEDURE DIVISION.
  ACCEPT WS-CELCIUS.
  COMPUTE WS-FARENHEIT = (WS-CELCIUS * 9/5) + 32.
  DISPLAY "FARENHEIT =" WS-FARENHEIT.
STOP RUN.

2.FACTORIAL

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-FACT PIC 9(3) VALUE 1.
  01 WS-A PIC 9(7).
  01 WS-I PIC 9(2) VALUE 1.
  
PROCEDURE DIVISION.
  ACCEPT WS-A.
  PERFORM UNTIL WS-I > WS-A
    COMPUTE WS-FACT = WS-FACT * WS-I
    ADD 1 TO WS-I
  END-PERFORM.
  DISPLAY "FACT =" WS-FACT.
STOP RUN.

3.PRIME NUMBER

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-A PIC 9(7).
  01 WS-I PIC 9(2) VALUE 2.
  01 WS-RES PIC 9(2) VALUE 0.
  
PROCEDURE DIVISION.
  ACCEPT WS-A.
  IF WS-A <= 1
    DISPLAY "NOT PRIME"
    END-IF
  PERFORM UNTIL WS-I > WS-A / 2
    IF FUNCTION MOD(WS-A,WS-I) = 0
      MOVE 1 TO WS-RES
    END-IF
    ADD 1 TO WS-I
  END-PERFORM
  IF WS-RES = 1
    DISPLAY "NOT PRIME"
  ELSE
    DISPLAY "PRIME".
STOP RUN.

4.REVERSE NUMBER

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-A PIC 9(7).
  01 WS-REM PIC 9(2).
  01 WS-REV PIC 9(5) VALUE 0.
  01 WS-TEMP PIC 9(9).
  
PROCEDURE DIVISION.
  ACCEPT WS-A.
  MOVE WS-A TO WS-TEMP.
  PERFORM UNTIL WS-TEMP = 0
  COMPUTE WS-REM = FUNCTION MOD(WS-TEMP,10)
  COMPUTE WS-REV = WS-REV * 10 + WS-REM
  DIVIDE WS-TEMP BY 10
    GIVING WS-TEMP
  END-PERFORM.
  DISPLAY "WS-REV =" WS-REV.
STOP RUN.

5.PALINDROME

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-A PIC 9(7).
  01 WS-REM PIC 9(2).
  01 WS-REV PIC 9(5) VALUE 0.
  01 WS-TEMP PIC 9(9).
  
PROCEDURE DIVISION.
  ACCEPT WS-A.
  MOVE WS-A TO WS-TEMP.
  PERFORM UNTIL WS-TEMP = 0
  COMPUTE WS-REM = FUNCTION MOD(WS-TEMP,10)
  COMPUTE WS-REV = WS-REV * 10 + WS-REM
  DIVIDE WS-TEMP BY 10
    GIVING WS-TEMP
  END-PERFORM.
  IF WS-A = WS-REV
    DISPLAY "PALINDROME"
  ELSE
    DISPLAY "NOT A PALINDROME"
  
STOP RUN.

6.SIMPLE INTEREST

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-P PIC 9(9).
  01 WS-N PIC 9(6).
  01 WS-R PIC 9(6).
  01 WS-SI PIC 9(9).
  
PROCEDURE DIVISION.
  ACCEPT WS-P.
  ACCEPT WS-N.
  ACCEPT WS-R.
  COMPUTE WS-SI = (WS-P * WS-N * WS-R) / 100.
  DISPLAY "WS-SI =" WS-SI.
  
STOP RUN.

7.PRINT NUM 1 TO 100

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-NUM PIC 9(3) VALUE 1.
  
PROCEDURE DIVISION.
  PERFORM UNTIL WS-NUM > 100
    DISPLAY WS-NUM
    ADD 1 TO WS-NUM
  END-PERFORM
STOP RUN.

8.compound interest

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-P PIC 9(9).
  01 WS-N PIC 9(6).
  01 WS-R PIC 9(6).
  01 WS-CI PIC 9(6)V9(9).
  01 WS-AMOUNT PIC 9(6)V9(9).
  
PROCEDURE DIVISION.
  ACCEPT WS-P.
  ACCEPT WS-N.
  ACCEPT WS-R.
  COMPUTE WS-AMOUNT = WS-P* (1+WS-R/100)**WS-N
  COMPUTE WS-CI = WS-AMOUNT - WS-P
  DISPLAY "WS-CI =" WS-CI.
  
STOP RUN.

9.Print numbers from 1-1000 which are divisible by the numbers 2,3 and 17

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-NUM PIC 9(3) VALUE 1.
  
PROCEDURE DIVISION.
  PERFORM UNTIL WS-NUM > 1000
    IF FUNCTION MOD(WS-NUM,2) = 0 OR FUNCTION MOD(WS-NUM,3) = 0 OR FUNCTION MOD(WS-NUM,17) = 0
      DISPLAY WS-NUM
    END-IF
    ADD 1 TO WS-NUM
  END-PERFORM
STOP RUN.

10.FIBONACCI 

IDENTIFICATION DIVISION.
PROGRAM-ID. LOGAVYA.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A     PIC 9(8) VALUE 0.
01 WS-B     PIC 9(8) VALUE 1.
01 WS-C     PIC 9(8) VALUE 0.
01 WS-SUM   PIC 9(8) VALUE 1.

PROCEDURE DIVISION.
    DISPLAY WS-A
    DISPLAY WS-B

    PERFORM UNTIL WS-C > 100
        COMPUTE WS-C = WS-A + WS-B
        IF WS-C <= 100
            DISPLAY WS-C
            ADD WS-C TO WS-SUM
        END-IF
        MOVE WS-B TO WS-A
        MOVE WS-C TO WS-B
    END-PERFORM

    DISPLAY "SUM = " WS-SUM
    STOP RUN.




